In [1]:
import pandas as pd

In [14]:
d1 = pd.DataFrame([['a',1],['b',2]], columns=['col1','number'])

In [7]:
d2 = pd.DataFrame([['c',3, 'lion'], ['d',4, 'tiger']] , columns=['letter','number','animal'] )

In [15]:
d1

  col1  number
0    a       1
1    b       2

In [10]:
d2

  letter  number animal
0      c       3   lion
1      d       4  tiger

In [16]:
pd.concat([d1,d2], axis=0 , sort=True)

  animal col1 letter  number
0    NaN    a    NaN       1
1    NaN    b    NaN       2
0   lion  NaN      c       3
1  tiger  NaN      d       4

In [18]:
pd.concat([d1,d2], axis=0 , sort=True , ignore_index=True)

  animal col1 letter  number
0    NaN    a    NaN       1
1    NaN    b    NaN       2
2   lion  NaN      c       3
3  tiger  NaN      d       4

In [21]:
pd.concat([d1,d2], axis=1 , sort=True , ignore_index=True)

   0  1  2  3      4
0  a  1  c  3   lion
1  b  2  d  4  tiger